app/controllers/soap/v1_controller.rb

INSERT INTO "boards" ("turn", "created_at", "updated_at") VALUES (?, ?, ?)  [["turn", 1], ["created_at", "2015-12-17 13:31:24.152998"], ["updated_at", "2015-12-17 13:31:24.152998"]]
---
  def createBoard
    board = Board.new
    board.turn = 1
    board.save

SELECT  "boards".* FROM "boards" WHERE "boards"."id" = ? LIMIT 1  [["id", 1]]
SELECT "players".* FROM "players" WHERE "players"."board_id" = ?  [["board_id", 1]]
---
  def getBoard
    board = Board.find_by_id(params[:id])
    if board
      boardHash = Hash.new
      boardHash['id'] = board.id
      boardHash['turn'] = board.turn
      boardHash['layout'] = display_board board.id
      players = Array.new

      board.players.each do |pl|

SELECT "boards".* FROM "boards"
---
  def listBoards
    boards = Array.new
    begin
      Board.all.each do |board_db|

SELECT  "boards".* FROM "boards" WHERE "boards"."id" = ? LIMIT 1  [["id", 1]]
SELECT "players".* FROM "players" WHERE "players"."board_id" = ?  [["board_id", 1]]
DELETE FROM "players" WHERE "players"."id" = ?  [["id", 1]]
---
  def resetBoard
    board = Board.find_by_id params[:id]
    board.turn = 1
    board.save
    create_board board.id
    board.players.each do |player|
      player.destroy!

SELECT  "boards".* FROM "boards" WHERE "boards"."id" = ? LIMIT 1  [["id", 2]]
SELECT "players".* FROM "players" WHERE "players"."board_id" = ?  [["board_id", 2]]
DELETE FROM "players" WHERE "players"."id" = ?  [["id", 1]]
DELETE FROM "boards" WHERE "boards"."id" = ?  [["id", 2]]
---
  def destroyBoard
    begin
      board = Board.find params[:id]
      board.players.each do |player|
        player.destroy
      end
      board.destroy

SELECT  "boards".* FROM "boards" WHERE "boards"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "players".* FROM "players" WHERE "players"."board_id" = ? AND "players"."name" = ? LIMIT 1  [["board_id", 1], ["name", "Ramandeep"]]
INSERT INTO "players" ("board_id", "name", "position", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["board_id", 1], ["name", "Ramandeep"], ["position", 0], ["created_at", "2015-12-17 07:10:36.712981"], ["updated_at", "2015-12-17 07:10:36.712981"]]
---
  def joinPlayer
    board = Board.find_by_id params[:board_id]
    player = nil
    if board.players.find_by_name params['player_name']
      raise SOAPError, "Player already exists on board"
    else
      player = board.players.new
      player.name = params['player_name']
      player.position = 0
      player.save

SELECT  "players".* FROM "players" WHERE "players"."id" = ? LIMIT 1  [["id", nil]]
---
  def getPlayer
    foundPlayer = Hash.new
    begin
      player = Player.find params[:id]

SELECT  "players".* FROM "players" WHERE "players"."id" = ? LIMIT 1  [["id", 3]]
UPDATE "players" SET "name" = ?, "updated_at" = ? WHERE "players"."id" = ?  [["name", "Karandeep Singh"], ["updated_at", "2015-12-17 07:54:28.855542"], ["id", 3]]
---
  def updatePlayer
    foundPlayer = Hash.new
    begin
      player = Player.find params[:id]
      player.name = params[:name]
      player.save

SELECT  "players".* FROM "players" WHERE "players"."id" = ? LIMIT 1  [["id", 1]]
DELETE FROM "players" WHERE "players"."id" = ?  [["id", 3]]
---
  def quitPlayer
    foundPlayer = Hash.new
    begin
      player = Player.find params[:id]
      player.destroy

SELECT  "boards".* FROM "boards" WHERE "boards"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "players".* FROM "players" WHERE "players"."board_id" = ? AND "players"."id" = ? LIMIT 1  [["board_id", 1], ["id", 4]]
SELECT  "players"."id", "players"."name", "players"."position" FROM "players" WHERE "players"."id" = ? LIMIT 1  [["id", 4]]
---
  def playTurn
    response = Hash.new
    begin
      board = Board.find params[:board_id]
      player = board.players.find params[:player_id]
      turn_player = board.players.all[board.turn-1]
      if turn_player.id == player.id
        roll = move board.id, player.id
        response['board_id'] = board.id
        response['boardLayout'] = display_board board.id
        response['roll'] = roll
        movedPlayer = Player.select(:id, :name, :position).find_by_id(player.id)