app/controllers/soap/v2_controller.rb

  def getBoard
    board = Board.find_by_id(params[:id])
    if board
      boardHash = Hash.new
      boardHash['id'] = board.id
      boardHash['turn'] = board.turn
      boardHash['layout'] = display_board board.id
      players = Array.new

      board.players.each do |pl|
---
SELECT  "boards".* FROM "boards" WHERE "boards"."id" = ? LIMIT 1  [["id", 3]]
SELECT "players".* FROM "players" WHERE "players"."board_id" = ?  [["board_id", 3]]

  def listBoards
    boards = Array.new
    begin
      Board.all.each do |board_db|
---
SELECT "boards".* FROM "boards"