app/controllers/rest/v1/board_controller.rb

  def index
    expires_now()
    status_code = 200
    response = Hash.new
    begin
      boards = Array.new
      Board.all.each do |board_row|
---
SELECT "boards".* FROM "boards"

  def show
    expires_now()
    board = Board.find_by_id params[:id]
    response = Hash.new
    if board
      response['board'] = Hash.new
      response['board']['layout'] = display_board board.id
      response['board']['id'] = board.id
      response['board']['turn'] = board.turn
      response['board']['players'] = Array.new
      board.players.each do |pl|
---
SELECT  "boards".* FROM "boards" WHERE "boards"."id" = ? LIMIT 1  [["id", 1]]
SELECT "players".* FROM "players" WHERE "players"."board_id" = ?  [["board_id", 1]]

  def new
    expires_now()
    board = Board.new
    board.turn = 1
    board.save
---
INSERT INTO "boards" ("turn", "created_at", "updated_at") VALUES (?, ?, ?)  [["turn", 1], ["created_at", "2015-12-16 13:47:29.886836"], ["updated_at", "2015-12-16 13:47:29.886836"]]

  def destroy
    expires_now()
    status_code = 200
    response = nil
    begin
      board = Board.find params[:id]
      board.players.each do |player|
        player.destroy
      end
      board.destroy
---
SELECT  "boards".* FROM "boards" WHERE "boards"."id" = ? LIMIT 1  [["id", 1]]
SELECT "players".* FROM "players" WHERE "players"."board_id" = ?  [["board_id", 1]]
DELETE FROM "players" WHERE "players"."id" = ?  [["id", 5]]
DELETE FROM "boards" WHERE "boards"."id" = ?  [["id", 1]]