app/controllers/rest/v1/move_controller.rb

  def show
    expires_now
    board = Board.find_by_id params[:id]
    response = Hash.new
    if board
      player = board.players.find_by_id params[:player_id]
      if player
        turn_player = board.players.all[board.turn-1]
        if turn_player.id == player.id
          roll = move board.id, player.id
          response['board'] = display_board board.id
          response['roll'] = roll
          response['player'] = Player.select(:id, :name, :board_id, :position).find_by_id(player.id)
---
SELECT  "boards".* FROM "boards" WHERE "boards"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "players".* FROM "players" WHERE "players"."board_id" = ? AND "players"."id" = ? LIMIT 1  [["board_id", 1], ["id", 2]]
SELECT  "players"."id", "players"."name", "players"."board_id", "players"."position" FROM "players" WHERE "players"."id" = ? LIMIT 1  [["id", 3]]