app/controllers/rest/v2/board_controller.rb

  def index
    expires_now()
    status_code = 200
    response = Hash.new
    begin
      boards = Array.new
      Board.all.each do |board_row|
---
SELECT "boards".* FROM "boards"

  def show
    expires_now()
    board = Board.find_by_id params[:id]
    response = Hash.new
    if board
      response['board'] = Hash.new
      response['board']['layout'] = display_board board.id
      response['board']['id'] = board.id
      response['board']['turn'] = board.turn
      response['board']['players'] = Array.new
      board.players.each do |pl|
---
SELECT  "boards".* FROM "boards" WHERE "boards"."id" = ? LIMIT 1  [["id", 1]]
SELECT "players".* FROM "players" WHERE "players"."board_id" = ?  [["board_id", 1]]