app/controllers/rest/v2/player_controller.rb

  def create
    expires_now()
    request_body = parse_request request.body.read, request.format.symbol
    response = Hash.new
    if request_body['board'] != nil
      board = Board.find_by_id request_body['board']
      if board
        if board.players.find_by_name request_body['player']['name']
          response = response_hash -1, "Player already exists", request.format.symbol
        else
          player = board.players.new # {"name"=> request_body['player']['name'], "turn"=> 0}
          player.name = request_body['player']['name']
          player.position = 0
          player.save
          created_player = Player.select(:id, :board_id, :name, :position).find_by_id player.id
---
SELECT  "boards".* FROM "boards" WHERE "boards"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "players".* FROM "players" WHERE "players"."board_id" = ? AND "players"."name" = ? LIMIT 1  [["board_id", 3], ["name", "Ramandeep"]]
INSERT INTO "players" ("board_id", "name", "position", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["board_id", 3], ["name", "Ramandeep"], ["position", 0], ["created_at", "2015-12-17 21:40:09.966839"], ["updated_at", "2015-12-17 21:40:09.966839"]]
SELECT  "players"."id", "players"."board_id", "players"."name", "players"."position" FROM "players" WHERE "players"."id" = ? LIMIT 1  [["id", 2]]